In [2]:
import pandas as pd

In [4]:
# 로우 드롭하기
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [7]:
df.drop(['John', 'Nate'])
# 드롭된 결과가 데이터프레임에 저장되지 않음.

       age        job
Jenny   30  developer

In [12]:
# 데이터 프레임에 저장하는 법 1
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])
df = df.drop(['John', 'Nate'])
df

       age        job
Jenny   30  developer

In [28]:
# 데이터프레임에 저장하는 법 2 (드롭된 결과 바로 저장하기)
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [29]:
df.drop(['John', 'Nate'], inplace=True)

In [30]:
df

       age        job
Jenny   30  developer

In [31]:
# 로우 인덱스로 드롭하기
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [32]:
df = df.drop(df.index[[0, 2]])
df

    name  age        job
1  Jenny   30  developer

In [33]:
# 컬럼값으로 로우 드롭하기

friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [35]:
df = df[df.age == 30]
# age 컬럼의 인덱스가 30인 인덱스만 출력
df

Empty DataFrame
Columns: [name, age, job]
Index: []

In [36]:
# 컬럼 드롭하기

friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [37]:
df = df.drop('age', axis=1)
# age컬럼 없애기
df

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher